saasapp/app/controllers/contacts_controller.rb

  def create
    # Mass assignement of form fields into Contact object
    @contact = Contact.new(contact_params)
    # Save Contact object into database
    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aBI"], ["email", "OKI"], ["comments", "youknow"], ["created_at", 2019-09-30 10:29:10 UTC], ["updated_at", 2019-09-30 10:29:10 UTC]]